Autodesk.Revit.DB.HorizontalTextAlignment
Since:
2016
Supported kinds of text horizontal alignment within the text containing box.
Since:
2016

Autodesk.Revit.DB.HorizontalTextAlignment.Center
Text is centered within the text box.

Autodesk.Revit.DB.HorizontalTextAlignment.Right
Text is aligned on the righ side of the text box.

Autodesk.Revit.DB.HorizontalTextAlignment.Left
Text is aligned on the left side of the text box.